
public class Task02 {
	// Задача 2: Да се изведат на екрана числат от -20 до 50.

	public static void main(String[] args) {
		int x = -20;
		while(x <= 50) {
			System.out.println(x++);
		}
	}

}
